# GenericImportOptions Class

---
Generic Import options.
SystemObject Autodesk.Revit.DBGenericImportOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public abstract class GenericImportOptions

    Public MustInherit Class GenericImportOptions

    public ref class GenericImportOptions abstract

    [<AbstractClassAttribute>]
    type GenericImportOptions = class end
The GenericImportOptions type exposes the following members.
| Name| Description
---|---|---
| RefPoint| Reference point (in Revit) to which the image is going to be inserted.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace